* McDowell (2020) 14N
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | mcdowell_2021_14n
Alternate name                        | 
Data source                           |  McDowell, I. E., Humphrey, N. F., Harper, J. T., and Meierbachtol, T. W.: The cooling signature of basal crevasses in a hard-bedded region of the Greenland Ice Sheet, The Cryosphere, 15, 897–907, https://doi.org/10.5194/tc-15-897-2021, 2021.
Drill year(s)                         | 2014
Data year(s)                          | August 2015
Longitude [°E]                        | -49.57231502
Latitude [°N]                         | 67.18300296
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 641
Ice thickness year                    | 2014
Ice thickness source                  | See raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | B
Depth of top measurement [m]          | 18
Depth of bottom measurement [m]       | 623
#+end_example

** Temperature

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Thickness

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)
 
** Location

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :exports none
import numpy as np
import pandas as pd

df_bot = pd.read_csv("meta.bsv", sep="|", index_col=0, header=None, squeeze=True)
thick = np.float(df_bot['Ice thickness [m]'])
df = pd.read_csv('data_bottom.csv')
df = df[df.columns[::-1]] # d,t -> t,d
df['d'] = thick - df['d']
df.to_csv('data.csv', index=False)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS:
|                   t |     d |
|      -4.63698236564 |  18.0 |
|      -5.08779610524 |  38.0 |
|      -5.53860984484 |  58.0 |
|      -6.30192358444 |  78.0 |
|  -7.002737324039999 |  98.0 |
|      -7.51605106364 | 118.0 |
|  -7.904364803239999 | 138.0 |
|      -8.29267854284 | 158.0 |
|      -8.80599228244 | 178.0 |
|      -9.19430602204 | 198.0 |
|  -9.520119761639998 | 218.0 |
|      -9.90843350124 | 238.0 |
|     -10.10924724084 | 258.0 |
|     -10.37256098044 | 278.0 |
|     -10.51087472004 | 298.0 |
|     -10.52418845964 | 318.0 |
| -10.475002199239999 | 338.0 |
|     -10.36331593884 | 358.0 |
|     -10.12662967844 | 378.0 |
|      -9.76494341804 | 398.0 |
|  -9.278257157639999 | 418.0 |
|      -8.72907089724 | 438.0 |
|  -8.117384636839999 | 458.0 |
|  -7.505698376439999 | 478.0 |
|  -7.137355246239999 | 488.0 |
|      -6.70651211604 | 498.0 |
|      -6.33816898584 | 508.0 |
|      -5.96982585564 | 518.0 |
|      -5.47648272544 | 528.0 |
|      -4.98313959524 | 538.0 |
|      -4.48979646504 | 548.0 |
| -3.9339533348400004 | 558.0 |
|      -3.56561020464 | 568.0 |
|      -3.00976707444 | 578.0 |
|      -2.51642394424 | 588.0 |
|      -2.08558081404 | 598.0 |
|      -1.59223768384 | 608.0 |
| -1.2238945536399999 | 618.0 |
|      -0.85555142344 | 628.0 |

